tukano-artillery-tests/logs/db-nosql-5.txt
--------------------------------
Summary report @ 12:11:20(+0000)
--------------------------------

http.codes.200: ................................................................ 750
http.codes.204: ................................................................ 450
http.downloaded_bytes: ......................................................... 59683
http.request_rate: ............................................................. 34/sec
http.requests: ................................................................. 1200
http.response_time:
  min: ......................................................................... 327
  max: ......................................................................... 1497
  mean: ........................................................................ 670
  median: ...................................................................... 727.9
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1274.3
http.response_time.2xx:
  min: ......................................................................... 327
  max: ......................................................................... 1497
  mean: ........................................................................ 670
  median: ...................................................................... 727.9
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1274.3
http.responses: ................................................................ 1200
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 150
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 150
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 723
  max: ......................................................................... 1369
  mean: ........................................................................ 764.1
  median: ...................................................................... 742.6
  p95: ......................................................................... 925.4
  p99: ......................................................................... 1224.4
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 815
  max: ......................................................................... 1497
  mean: ........................................................................ 881.6
  median: ...................................................................... 837.3
  p95: ......................................................................... 1224.4
  p99: ......................................................................... 1436.8
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 826
  max: ......................................................................... 1218
  mean: ........................................................................ 851.6
  median: ...................................................................... 837.3
  p95: ......................................................................... 854.2
  p99: ......................................................................... 1200.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 425
  max: ......................................................................... 876
  mean: ........................................................................ 451
  median: ...................................................................... 441.5
  p95: ......................................................................... 487.9
  p99: ......................................................................... 742.6
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 427
  max: ......................................................................... 851
  mean: ........................................................................ 446.2
  median: ...................................................................... 432.7
  p95: ......................................................................... 450.4
  p99: ......................................................................... 727.9
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 1040
  max: ......................................................................... 1463
  mean: ........................................................................ 1153.3
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1380.5
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 418
  max: ......................................................................... 1000
  mean: ........................................................................ 456.5
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 871.5
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 327
  max: ......................................................................... 831
  mean: ........................................................................ 355.5
  median: ...................................................................... 340.4
  p95: ......................................................................... 368.8
  p99: ......................................................................... 685.5
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5535.9
  max: ......................................................................... 7194.1
  mean: ........................................................................ 5833.2
  median: ...................................................................... 5711.5
  p95: ......................................................................... 6702.6
  p99: ......................................................................... 7117